Autodesk.Revit.DB.Structure.RebarHandleType.OutOfPlaneExtent
Handle controlling the extent of a three-dimensional Rebar out of
its primary plane. This includes the length of a Rebar Set, the
out-of-plane length of a multi-planar Rebar, and the length of a
spiral Rebar.

Autodesk.Revit.DB.Structure.RebarHandleType.Undefined
Represents an undefined handle. If this value is returned, then the handle cannot find its type.